ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_cscs.c
/***************************************************************************//**
* \file cy_ble_cscs.c
* \version 2.0
*
* \brief
*  Contains the source code for the Cycling Speed and Cadence Service.
*
********************************************************************************
* \copyright
* Copyright 2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_ble_event_handler.h"

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

#if (CY_BLE_MODE_PROFILE && defined(CY_BLE_CSCS))

static cy_ble_callback_t Cy_BLE_CSCS_ApplCallback = NULL;


#ifdef CY_BLE_CSCS_SERVER
/* The internal storage for the last request handle to check response for server */
static cy_ble_gatt_db_attr_handle_t cy_ble_cscssReqHandle;
#endif /* CY_BLE_CSCS_SERVER */

#ifdef CY_BLE_CSCS_CLIENT
/* CSCS Center Service characteristics GATT DB handles structure */
cy_stc_ble_cscsc_t cy_ble_cscsc[CY_BLE_CONFIG_GATTC_COUNT];

/* The internal storage for the last request handle to check response */
static cy_ble_gatt_db_attr_handle_t cy_ble_cscscReqHandle[CY_BLE_CONFIG_GATTC_COUNT];

CY_SECTION(".cy_wflash") CY_ALIGN(CY_FLASH_SIZEOF_ROW)
static const cy_stc_ble_cscsc_t cy_ble_flashCscsc[CY_BLE_CONFIG_GATTC_COUNT] =
{
    {
        .characteristics[CY_BLE_CSCS_CSC_MEASUREMENT] =
        {
            .charInfo    ={ 0u, 0u                 },
            .endHandle   = 0u,
            .descriptors ={ 0u }
        },
        .characteristics[CY_BLE_CSCS_CSC_FEATURE] =
        {
            .charInfo    ={ 0u, 0u                 },
            .endHandle   = 0u,
            .descriptors ={ 0u }
        },
        .characteristics[CY_BLE_CSCS_SENSOR_LOCATION] =
        {
            .charInfo    ={ 0u, 0u                 },
            .endHandle   = 0u,
            .descriptors ={ 0u }
        },
        .characteristics[CY_BLE_CSCS_SC_CONTROL_POINT] =
        {
            .charInfo    ={ 0u, 0u                 },
            .endHandle   = 0u,
            .descriptors ={ 0u }
        },
    }
};

#endif /* (CY_BLE_CSCS_CLIENT) */

/* The pointer on global BLE CSCS Config structure */
cy_stc_ble_cscs_config_t *cy_ble_cscsConfigPtr = NULL;

/***************************************
* Private Function Prototypes
***************************************/

#ifdef CY_BLE_CSCS_SERVER
static cy_en_ble_gatt_err_code_t Cy_BLE_CSCSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam);
static void Cy_BLE_CSCSS_ConfirmationEventHandler(const cy_stc_ble_conn_handle_t *eventParam);
#endif /* CY_BLE_CSCS_SERVER */

#ifdef CY_BLE_CSCS_CLIENT
static void Cy_BLE_CSCSC_DiscoverCharacteristicsEventHandler(cy_stc_ble_disc_char_info_t *discCharInfo);
static void Cy_BLE_CSCSC_DiscoverCharDescriptorsEventHandler(cy_stc_ble_disc_descr_info_t *discDescrInfo);
static void Cy_BLE_CSCSC_GetCharRange(cy_stc_ble_disc_range_info_t *charRangeInfo);
static void Cy_BLE_CSCSC_NotificationEventHandler(cy_stc_ble_gattc_handle_value_ntf_param_t *eventParam);
static void Cy_BLE_CSCSC_IndicationEventHandler(cy_stc_ble_gattc_handle_value_ind_param_t *eventParam);
static void Cy_BLE_CSCSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam);
static void Cy_BLE_CSCSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam);
static void Cy_BLE_CSCSC_ErrorResponseEventHandler(const cy_stc_ble_gatt_err_param_t *eventParam);
#endif /* (CY_BLE_CSCS_CLIENT) */
static cy_en_ble_gatt_err_code_t Cy_BLE_CSCS_EventHandler(uint32_t eventCode, void *eventParam);


/******************************************************************************
* Function Name: Cy_BLE_CSCS_Init
***************************************************************************//**
*
*  This function initializes the Cycling Speed and Cadence Service.
*
*  \param config: Configuration structure for the Cycling Speed and Cadence Service.
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error Codes                             | Description
*   ------------                            | -----------
*   CY_BLE_SUCCESS                          | The function completed successfully.
*   CY_BLE_ERROR_INVALID_PARAMETER          | On specifying NULL as input parameter
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED   | Buffer overflow in the registration callback.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_CSCS_Init(cy_stc_ble_cscs_config_t *config)
{
    cy_en_ble_api_result_t apiResult;

    if(config == NULL)
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        /* Registers a pointer to config structure*/
        cy_ble_cscsConfigPtr = config;

        /* Registers Event Handler for the CSCS Service */
        apiResult = Cy_BLE_RegisterServiceEventHandler(&Cy_BLE_CSCS_EventHandler);

        /* Registers a callback function via config structure */
        if(cy_ble_cscsConfigPtr->callbackFunc != NULL)
        {
            Cy_BLE_CSCS_ApplCallback = cy_ble_cscsConfigPtr->callbackFunc;
        }

    #if defined(CY_BLE_CSCS_SERVER)
        cy_ble_cscssReqHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
    #endif /* CY_BLE_CSCS_SERVER */

    #ifdef CY_BLE_CSCS_CLIENT
        {
            uint32_t idx;
            for(idx = 0u; idx < CY_BLE_CONFIG_GATTC_COUNT; idx++)
            {
                if(cy_ble_serverInfo[idx][CY_BLE_SRVI_CSCS].range.startHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
                {
                    if(cy_ble_serverInfo[idx][CY_BLE_SRVI_CSCS].range.startHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
                    {
                        (void)memcpy(&cy_ble_cscsc[idx], &cy_ble_flashCscsc[idx], sizeof(cy_stc_ble_cscsc_t));

                        /* initialize uuid  */
                        cy_ble_serverInfo[idx][CY_BLE_SRVI_CSCS].uuid = CY_BLE_UUID_CYCLING_SPEED_AND_CADENCE_SERVICE;
                    }
                    cy_ble_cscscReqHandle[idx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                }
            }
        }
    #endif /* CY_BLE_CSCS_CLIENT */
    }

    return(apiResult);
}


