ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_cscs.c
/******************************************************************************
* Function Name: Cy_BLE_CSCS_RegisterAttrCallback
***************************************************************************//**
*
*  Registers a callback function for Cycling Speed and Cadence Service specific
*  attribute operations.
*  Service specific write requests from peer device will not be handled with
*  unregistered callback function.
*
*  \param callbackFunc: An application layer event callback function to receive
*                 events from the BLE Component. The definition of
*                 cy_ble_callback_t for CSCS is:
*                 typedef void (* cy_ble_callback_t) (uint32_t eventCode,
*                                                   void *eventParam)
*                 * eventCode indicates the event that triggered this
*                   callback.
*                 * eventParam contains the parameters corresponding to the
*                   current event.
*
* \sideeffect The *eventParams in the callback function should not be used by
*                the application once the callback function execution is
*                finished. Otherwise this data may become corrupted.
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes:
*
*   Error Codes                             | Description
*   ------------                            | -----------
*   CY_BLE_SUCCESS                          | The function completed successfully.
*   CY_BLE_ERROR_INVALID_OPERATION          | This operation is not permitted
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_CSCS_RegisterAttrCallback(cy_ble_callback_t callbackFunc)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    
    Cy_BLE_CSCS_ApplCallback = callbackFunc;
    if(cy_ble_cscsConfigPtr != NULL)
    {
        cy_ble_cscsConfigPtr->callbackFunc = callbackFunc;
    }
    else
    {
        apiResult = CY_BLE_ERROR_INVALID_OPERATION;
    }
    
    return(apiResult);
}


#ifdef CY_BLE_CSCS_SERVER

/******************************************************************************
* Function Name: Cy_BLE_CSCSS_WriteEventHandler
***************************************************************************//**
*
*  Handles the Write Request Event for the Cycling Speed and Cadence Service.
*
*  \param  *eventParam: The pointer to the data that came
*                       with a write request for the
*                       Cycling Speed and Cadence Service.
*
* \return
*  Return a value of type cy_en_ble_gatt_err_code_t:
*   * CY_BLE_GATT_ERR_NONE - function terminated successfully.
*   * CY_BLE_GATT_ERR_INVALID_HANDLE - the handle of a Client Configuration
*                                     Characteristic Descriptor is not valid.
*   * CY_BLE_GATT_ERR_UNLIKELY_ERROR - an Internal Stack error occurred.
*   * CY_BLE_GATT_ERR_REQUEST_NOT_SUPPORTED - the notification or indication
*                                            property of a specific
*                                            Characteristic of Cycling Speed and
*                                            Cadence Service is disabled.
*
******************************************************************************/
static cy_en_ble_gatt_err_code_t Cy_BLE_CSCSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    cy_stc_ble_cscs_char_value_t wrReqParam = { .connHandle = eventParam->connHandle };
    cy_ble_gatt_db_attr_handle_t tmpHandle;
    cy_en_ble_gatt_err_code_t gattErr = CY_BLE_GATT_ERR_NONE;
    uint32_t event = (uint32_t)CY_BLE_EVT_CSCSS_WRITE_CHAR;
    uint32_t handleWasFound = 1u;

    tmpHandle = eventParam->handleValPair.attrHandle;

    if(Cy_BLE_CSCS_ApplCallback != NULL)
    {
        /* Client Characteristic Configuration Descriptor Write Request */
        if(tmpHandle == cy_ble_cscsConfigPtr->cscss->charInfo[CY_BLE_CSCS_CSC_MEASUREMENT].descrHandle[CY_BLE_CSCS_CCCD])
        {
            /* Verify that optional notification property is enabled for the Characteristic */
            if(CY_BLE_IS_NOTIFICATION_SUPPORTED(cy_ble_cscsConfigPtr->cscss->charInfo[CY_BLE_CSCS_CSC_MEASUREMENT].
                                                 charHandle))
            {
                if(CY_BLE_IS_NOTIFICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                {
                    event = (uint32_t)CY_BLE_EVT_CSCSS_NOTIFICATION_ENABLED;
                }
                else
                {
                    event = (uint32_t)CY_BLE_EVT_CSCSS_NOTIFICATION_DISABLED;
                }

                wrReqParam.charIndex = CY_BLE_CSCS_CSC_MEASUREMENT;

                /* Value is NULL for descriptors */
                wrReqParam.value = NULL;

            #if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && \
                (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))
                /* Set flag to store bonding data to flash */
                if(cy_ble_peerBonding[eventParam->connHandle.attId] == CY_BLE_GAP_BONDING)
                {
                    cy_ble_pendingFlashWrite |= CY_BLE_PENDING_CCCD_FLASH_WRITE_BIT;
                }
            #endif /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */
            }
            else
            {
                gattErr = CY_BLE_GATT_ERR_REQUEST_NOT_SUPPORTED;
            }
        }
        else if(tmpHandle == cy_ble_cscsConfigPtr->cscss->charInfo[CY_BLE_CSCS_SC_CONTROL_POINT].
                 descrHandle[CY_BLE_CSCS_CCCD])
        {
            /* Verify that optional indication property is enabled for the Characteristic */
            if(CY_BLE_IS_INDICATION_SUPPORTED(cy_ble_cscsConfigPtr->cscss->charInfo[CY_BLE_CSCS_SC_CONTROL_POINT].
                                               charHandle))
            {
                if(CY_BLE_IS_INDICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                {
                    event = (uint32_t)CY_BLE_EVT_CSCSS_INDICATION_ENABLED;
                }
                else
                {
                    event = (uint32_t)CY_BLE_EVT_CSCSS_INDICATION_DISABLED;
                }

                wrReqParam.charIndex = CY_BLE_CSCS_SC_CONTROL_POINT;

                /* Value is NULL for descriptors */
                wrReqParam.value = NULL;

