ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_cscs.c
/*******************************************************************************
* Function Name: Cy_BLE_CSCSS_GetCharacteristicValue
****************************************************************************//**
*
*  Gets a characteristic value of the Cycling Speed and Cadence Service, which
*  is identified by charIndex, from the GATT database.
*
*  \param charIndex:  The index of a service characteristic of
*                     type cy_en_ble_cscs_char_index_t. Valid value is,
*                     * CY_BLE_CSCS_SC_CONTROL_POINT.
*  \param attrSize:   The size of the characteristic value attribute.
*  \param attrValue: The pointer to the location where characteristic value data should be stored.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - The request is handled successfully.
*   * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameter failed.
*   * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - Optional characteristic is absent.
*
*******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_CSCSS_GetCharacteristicValue(cy_en_ble_cscs_char_index_t charIndex,
                                                           uint8_t attrSize,
                                                           uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_PARAMETER;

    if(CY_BLE_CSCS_CHAR_COUNT > charIndex)
    {
        if(cy_ble_cscsConfigPtr->cscss->charInfo[charIndex].charHandle != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
        {
            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair.attrHandle = cy_ble_cscsConfigPtr->cscss->charInfo[charIndex].charHandle,
                .handleValuePair.value.len  = attrSize,
                .handleValuePair.value.val  = attrValue,
                .offset                     = 0u,
                .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
            };
            /* Read characteristic value from database */
            if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) == CY_BLE_GATT_ERR_NONE)
            {
                apiResult = CY_BLE_SUCCESS;
            }
        }
        else
        {
            apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
        }
    }

    return(apiResult);
}


/*******************************************************************************
* Function Name: Cy_BLE_CSCSS_GetCharacteristicDescriptor
****************************************************************************//**
*
*  Gets a characteristic descriptor of a specified characteristic of the Cycling
*  Speed and Cadence Service, from the GATT database.
*
*  \param connHandle:   The connection handle
*  \param charIndex:    The index of a service characteristic of type cy_en_ble_cscs_char_index_t.
*                       Valid values are,
*                       * CY_BLE_CSCS_CSC_MEASUREMENT
*                       * CY_BLE_CSCS_SC_CONTROL_POINT.
*  \param descrIndex:   The index of a service characteristic descriptor of type
*                       cy_en_ble_cscs_descr_index_t. Valid value is
*                       * CY_BLE_CSCS_CCCD.
*  \param attrSize:     The size of the characteristic descriptor attribute.
*  \param attrValue:   The pointer to the location where characteristic descriptor value data
*                       should be stored.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - The request is handled successfully.
*   * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameter failed.
*   * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - Peer device doesn't have a
*                                                particular characteristic.
*
*******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_CSCSS_GetCharacteristicDescriptor(cy_stc_ble_conn_handle_t connHandle,
                                                                cy_en_ble_cscs_char_index_t charIndex,
                                                                cy_en_ble_cscs_descr_index_t descrIndex,
                                                                uint8_t attrSize,
                                                                uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_PARAMETER;

    if((CY_BLE_CSCS_CHAR_COUNT > charIndex) && (CY_BLE_CSCS_DESCR_COUNT > descrIndex))
    {
        if(cy_ble_cscsConfigPtr->cscss->charInfo[charIndex].descrHandle[descrIndex] !=
           CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
        {
            cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
            {
                .handleValuePair.attrHandle = cy_ble_cscsConfigPtr->cscss->charInfo[charIndex].descrHandle[descrIndex],
                .handleValuePair.value.len  = attrSize,
                .handleValuePair.value.val  = attrValue,
                .connHandle                 = connHandle,
                .offset                     = 0u,
                .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
            };
            if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) == CY_BLE_GATT_ERR_NONE)
            {
                apiResult = CY_BLE_SUCCESS;
            }
        }
        else
        {
            apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
        }
    }

    return(apiResult);
}


/*******************************************************************************
* Function Name: Cy_BLE_CSCSS_SendNotification
****************************************************************************//**
*
*  Sends notification with a characteristic value, which is specified by
*  charIndex, of the Cycling Speed and Cadence Service to the Client device.
*
*  On enabling notification successfully for a service characteristic it sends out a
*  'Handle Value Notification' which results in CY_BLE_EVT_CSCSC_NOTIFICATION event
*  at the GATT Client's end.
*
*  \param connHandle:    The connection handle.
*  \param charIndex:     The index of a service characteristic of
*                        type cy_en_ble_cscs_char_index_t. Valid value is
*                        * CY_BLE_CSCS_CSC_MEASUREMENT.
*  \param attrSize:      The size of the characteristic value attribute.
*  \param attrValue:    The pointer to the characteristic value
*                        data that should be sent to the Client device.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*   * CY_BLE_SUCCESS - The request is handled successfully.
*   * CY_BLE_ERROR_INVALID_PARAMETER - Validation of input parameter is failed.
*   * CY_BLE_ERROR_INVALID_OPERATION - Operation is invalid for this.
*                                      characteristic.
*   * CY_BLE_ERROR_INVALID_STATE - Connection with the client is not established.
*   * CY_BLE_ERROR_NTF_DISABLED - Notification is not enabled by the client.
*   * CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED - Memory allocation failed.
*
*******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_CSCSS_SendNotification(cy_stc_ble_conn_handle_t connHandle,
                                                     cy_en_ble_cscs_char_index_t charIndex,
                                                     uint8_t attrSize,
                                                     uint8_t *attrValue)
{
    /* Store new data in database */
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_PARAMETER;

    if(charIndex == CY_BLE_CSCS_CSC_MEASUREMENT)
    {
        /* Send Notification if it is enabled and connected */
        if(Cy_BLE_GetConnectionState(connHandle) < CY_BLE_CONN_STATE_CONNECTED)
        {
            apiResult = CY_BLE_ERROR_INVALID_STATE;
        }
        else if(!CY_BLE_IS_NOTIFICATION_ENABLED(connHandle.attId,
                                                cy_ble_cscsConfigPtr->cscss->charInfo[charIndex].
                                                 descrHandle[CY_BLE_CSCS_CCCD]))
        {
            apiResult = CY_BLE_ERROR_NTF_DISABLED;
        }
        else
        {
            /* Fill all fields of write request structure ... */
            cy_stc_ble_gatts_handle_value_ntf_t ntfReqParam =
            {
                .handleValPair.attrHandle = cy_ble_cscsConfigPtr->cscss->charInfo[charIndex].charHandle,
                .handleValPair.value.val  = attrValue,
                .handleValPair.value.len  = attrSize,
                .connHandle               = connHandle
            };
            /* Send notification to the Client using previously filled structure */
            apiResult = Cy_BLE_GATTS_Notification(&ntfReqParam);
        }
    }

    return(apiResult);
}


